In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import scipy.stats as stats
import seaborn as sns
from pydataset import data
from datetime import date
import warnings
warnings.simplefilter(action='ignore', category=FutureWarning)
from env import get_db_url, user, password, host

In [ ]:
# how to specify a google sheets url with a specific worksheet
url = f"https://docs.google.com/spreadsheets/d/{sheet_id}/gviz/tq?tqx=out:csv&sheet={sheet_name}"

#### 4. use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

In [4]:
df = data('iris')

#### 4a.     print the first 3 rows

In [6]:
df.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

#### 4b.     print the number of rows and columns (shape)

In [7]:
df.shape

(150, 5)

#### 4c.     print the column names

In [9]:
for column in df.columns:
    print(column)

Sepal.Length
Sepal.Width
Petal.Length
Petal.Width
Species

#### 4d. print the data type of each column

In [18]:
df.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

#### 4e.     print the summary statistics for each of the numeric variables

In [16]:
df.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

#### 5. Read the Table1_CustDetails table from your spreadsheet exercises google sheet into a dataframe named df_google_sheets.

In [45]:
url = 'https://docs.google.com/spreadsheets/d/1gb4xDK4WmoM0kBTOiurSNZzz3cQE1IVnRQ59YsUmTmw/export?format=csv#gid=1023018493'
df_google_sheets = pd.read_csv(url)

In [82]:
df_google_sheets.head(3)

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,monthly_charges,total_charges,churn
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,65.6,593.30,No
1,0003-MKNFE,Male,0,No,No,2,1,0,59.9,542.40,No
2,0004-TLHLJ,Male,0,No,No,1,2,0,73.9,280.85,Yes

#### 5a. assign the first 100 rows to a new dataframe, df_google_sheets_sample

In [47]:
df_google_sheets_sample = df_google_sheets.head(100)

#### 5b. print the number of rows of your original dataframe

In [48]:
df_google_sheets.shape[0]

7049

#### 5c. print the first five column names

In [49]:
for column in df_google_sheets.columns[:5]:
    print(column)

customer_id
gender
is_senior_citizen
partner
dependents

#### 5d. print the column names that have a data type of object

In [50]:
for column in df_google_sheets.dtypes[df_google_sheets.dtypes == 'object'].index:
    print(column)

customer_id
gender
partner
dependents
churn

#### 5e. compute the range for each of the numeric variables

In [81]:
ranges = df_google_sheets.select_dtypes(exclude=[object])
ranges = ranges.max() - ranges.min()
ranges

is_senior_citizen       1.0
phone_service           2.0
internet_service        2.0
contract_type           2.0
monthly_charges       100.5
total_charges        8666.0
dtype: float64

#### 6. Download your spreadsheet exercises google sheet as an excel file (File → Download → Microsoft Excel). Read the Table1_CustDetails worksheet into a dataframe named df_excel.

In [85]:
df_excel = pd.read_excel('df_excel.xlsx', sheet_name='Table1_CustDetails')
df_excel.head(3)

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,monthly_charges,total_charges,churn
0,0002-ORFBO,Female,0.0,Yes,Yes,1.0,1.0,1.0,65.6,593.30,No
1,0003-MKNFE,Male,0.0,No,No,2.0,1.0,0.0,59.9,542.40,No
2,0004-TLHLJ,Male,0.0,No,No,1.0,2.0,0.0,73.9,280.85,Yes

#### 6a. assign the first 100 rows to a new dataframe, df_excel_sample

In [86]:
df_excel_sample = df_excel.head(100)

#### 6b. print the number of rows of your original dataframe

In [87]:
df_excel.shape[0]

7049

#### 6c. print the first 5 column names

In [89]:
for column in df_excel.columns[:5]:
    print(column)

customer_id
gender
is_senior_citizen
partner
dependents

#### 6d. print the column names that have a data type of object

In [97]:
for column in df_google_sheets.select_dtypes(include=[object]).columns:
    print(column)

customer_id
gender
partner
dependents
churn

#### 6e. compute the range for each of the numeric variables.

In [98]:
ranges = df_google_sheets.select_dtypes(exclude=[object])
ranges = ranges.max() - ranges.min()
ranges

is_senior_citizen       1.0
phone_service           2.0
internet_service        2.0
contract_type           2.0
monthly_charges       100.5
total_charges        8666.0
dtype: float64

#### 7. read the data from the given google sheet into a dataframe, df_google

In [101]:
sheet_id = '1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g'
sheet_name = 'train'

url = f"https://docs.google.com/spreadsheets/d/{sheet_id}/gviz/tq?tqx=out:csv&sheet={sheet_name}"

df_google = pd.read_csv(url)

#### 7a. Print the first 3 rows

In [103]:
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,NaN,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,NaN,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,NaN,7.9250,NaN,S

#### 7b. print the number of rows and columns

In [105]:
df_google.shape

(891, 12)

#### 7c. print the column names

In [106]:
for column in df_google.columns:
    print(column)

PassengerId
Survived
Pclass
Name
Sex
Age
SibSp
Parch
Ticket
Fare
Cabin
Embarked

#### 7d. print the data type of each column

In [107]:
df_google.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket         float64
Fare           float64
Cabin           object
Embarked        object
dtype: object

#### 7e. print the summary statistics for each of the numeric variables

In [109]:
df_google.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Ticket,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,6.610000e+02,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,2.603185e+05,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,4.716093e+05,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,6.930000e+02,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,1.999600e+04,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,2.361710e+05,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,3.477430e+05,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,3.101298e+06,512.329200

#### 7f. Print the unique values for each of your categorical variables

In [115]:
categorical_columns = list(df_google.nunique()[df_google.nunique() < 10].index)
categorical_columns

['Survived', 'Pclass', 'Sex', 'SibSp', 'Parch', 'Embarked']

In [192]:
for i in range(df_google[categorical_columns].shape[1]):
    print(f'{df_google[categorical_columns].iloc[:, i].name}: {(df_google[categorical_columns].iloc[:, i].unique())}')

Survived: [0 1]
Pclass: [3 1 2]
Sex: ['male' 'female']
SibSp: [1 0 3 4 2 5 8]
Parch: [0 1 2 5 3 4 6]
Embarked: ['S' 'C' 'Q' nan]

In [186]:
#simpler way:

categorical_df = df_google.loc[:,df_google.nunique()<10]

for col in categorical_df.columns:
    print(f'{col}: {(categorical_df[col].unique())}')

Survived: [0 1]
Pclass: [3 1 2]
Sex: ['male' 'female']
SibSp: [1 0 3 4 2 5 8]
Parch: [0 1 2 5 3 4 6]
Embarked: ['S' 'C' 'Q' nan]

### 1. Make a function named get_titanic_data that returns the titanic data from the codeup data science database as a pandas data frame. Obtain your data from the Codeup Data Science Database.

In [173]:
import os
from env import get_db_url, user, password, host

def get_titanic_data():
    
    filename = 'titanic.csv'
    
    if os.path.exists(filename):
        print('Reading from local CSV...')
        return pd.read_csv(filename)
    
    url = get_db_url('titanic_db')
    sql = '''
    SELECT * FROM passengers
    '''
    
    print('No local file exists\nReading from SQL database...')
    df = pd.read_sql(sql, url)

    print('Saving to local CSV... ')
    df.to_csv(filename, index=False)
    
    return df

### 2. Make a function named get_iris_data that returns the data from the iris_db on the codeup data science database as a pandas data frame. The returned data frame should include the actual name of the species in addition to the species_ids. Obtain your data from the Codeup Data Science Database.

In [181]:
def get_iris_data():
    
    filename = 'iris.csv'
    
    if os.path.exists(filename):
        print('Reading from local CSV...')
        return pd.read_csv(filename)
        
    url = get_db_url('iris_db')
    sql = '''
    SELECT *
      FROM species
      JOIN measurements USING(species_id);
    '''
    
    print('No local file exists\nReading from SQL database...')
    df = pd.read_sql(sql, url)
    
    print('Saving to local CSV...')
    df.to_csv(filename, index=False)
    
    return df

### 3. Make a function named get_telco_data that returns the data from the telco_churn database in SQL. In your SQL, be sure to join all 4 tables together, so that the resulting dataframe contains all the contract, payment, and internet service options. Obtain your data from the Codeup Data Science Database.

In [183]:
def get_telco_data():
    
    filename = 'telco_chun.csv'
    
    if os.path.exists(filename):
        print('Reading from local CSV...')
        return pd.read_csv(filename)
    
    url = get_db_url('telco_churn')
    sql = '''
    SELECT * 
      FROM customers
        JOIN contract_types USING(contract_type_id)
        JOIN internet_service_types USING(internet_service_type_id)
        JOIN payment_types USING(payment_type_id)
    '''
    
    print('No local file exists\nReading from SQL database...')
    df = pd.read_sql(sql, url)
    
    print('Saving to local CSV...')
    df.to_csv(filename, index=False)
    
    return df

#### 4. Once you've got your get_titanic_data, get_iris_data, and get_telco_data functions written, now it's time to add caching to them. To do this, edit the beginning of the function to check for the local filename of telco.csv, titanic.csv, or iris.csv. If they exist, use the .csv file. If the file doesn't exist, then produce the SQL and pandas necessary to create a dataframe, then write the dataframe to a .csv file with the appropriate name.